# ClipPlane Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ClipPlane Members
ClipPlane Class Constructors Methods Properties See Also
---
The ClipPlane type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ClipPlane | Constructs a copy of the clip plane. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ClipPlane |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Normal | The plane's normal vector. |
| Origin | The plane's origin. |

# See Also
ClipPlane Class
Autodesk.Revit.DB.DirectContext3D Namespace